Ran Plan for project: `vntechies-gitops` dir: `terraform/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.vpc["demo-vpc"].data.aws_region.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc["demo-vpc"].data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
data.aws_subnets.eks_vpc_subnets: Reading...
data.aws_subnets.eks_vpc_subnets: Read complete after 0s [id=ap-southeast-1]
module.eks.data.aws_eks_addon_version.this["cni"]: Reading...
module.eks.data.tls_certificate.this: Reading...
data.aws_eks_cluster_auth.eks: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
data.aws_eks_cluster.eks: Reading...
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=thodung-vntechies-eks-demo-eks]
module.eks.data.tls_certificate.this: Read complete after 0s [id=5f0630e8a1c4ee9bd3e7e715837e311bdbd1cd3d]
data.aws_eks_cluster.eks: Read complete after 0s [id=thodung-vntechies-eks-demo-eks]
module.eks.data.aws_eks_addon_version.this["cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=010352592457]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - groups:
                  - system:bootstrappers
                  - system:nodes
                  rolearn: arn:aws:iam::010352592457:role/eks-node-group-thodung-vntechies-demo-eks
                  username: system:node:{{EC2PrivateDNSName}}
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be created
+ resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = {
          + "mapRoles" = <<-EOT
                - groups:
                  - system:bootstrappers
                  - system:nodes
                  rolearn: arn:aws:iam::010352592457:role/eks-node-group-thodung-vntechies-demo-eks
                  username: system:node:{{EC2PrivateDNSName}}
            EOT
        }
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vntechies-gitops`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hungran.cloud:4141/lock?id=vntechies%252F013-demo-gitops%252Fterraform%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vntechies-gitops -- -refresh=false`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`